Tekla.Structures.Drawing.StraightDimensionSet.StraightDimensionSetAttributes
The StraightDimensionSetAttributes class contains the attributes for managing
all the attributes of the straight dimension.
using Tekla.Structures.Drawing;
public class Example
{
public void Example1()
{
StraightDimensionSet.StraightDimensionSetAttributes attributes =
new StraightDimensionSet.StraightDimensionSetAttributes(null, "MyAttributes");
}
}

Tekla.Structures.Drawing.StraightDimensionSet.StraightDimensionSetAttributes.CombinedDimension
Combines the attributes of the dimension.

Tekla.Structures.Drawing.StraightDimensionSet.StraightDimensionSetAttributes.DimensionType
The dimension type.

Tekla.Structures.Drawing.StraightDimensionSet.StraightDimensionSetAttributes.ExtensionLine
The extension line presentation of the dimension.

Tekla.Structures.Drawing.StraightDimensionSet.StraightDimensionSetAttributes.ShortDimension
How short dimensions are shown.

Tekla.Structures.Drawing.StraightDimensionSet.StraightDimensionSetAttributes.UpdateGrouping
Indicates whether dimension grouping update is used.

Tekla.Structures.Drawing.StraightDimensionSet.StraightDimensionSetAttributes.NumericValueHidden
Indicates whether dimension numeric value is shown.

Tekla.Structures.Drawing.StraightDimensionSet.StraightDimensionSetAttributes.IncludePartCountInTag
Gets or sets whether the part count is included in at least one of the tag position, or set part count flag for all tag positions.

Tekla.Structures.Drawing.StraightDimensionSet.StraightDimensionSetAttributes.IncludePartCountInTagA
Gets or sets a value indicating whether the part count is included in the tag A.

Tekla.Structures.Drawing.StraightDimensionSet.StraightDimensionSetAttributes.IncludePartCountInTagB
Gets or sets a value indicating whether the part count is included in the tag B.

Tekla.Structures.Drawing.StraightDimensionSet.StraightDimensionSetAttributes.IncludePartCountInTagC
Gets or sets a value indicating whether the part count is included in the tag C.

Tekla.Structures.Drawing.StraightDimensionSet.StraightDimensionSetAttributes.IncludePartCountInTagD
Gets or sets a value indicating whether the part count is included in the tag D.

Tekla.Structures.Drawing.StraightDimensionSet.StraightDimensionSetAttributes.IncludePartCountInTagE
Gets or sets a value indicating whether the part count is included in the tag E.

Tekla.Structures.Drawing.StraightDimensionSet.StraightDimensionSetAttributes.IncludePartCountInTagF
Gets or sets a value indicating whether the part count is included in the tag F.

Tekla.Structures.Drawing.StraightDimensionSet.StraightDimensionSetAttributes.IncludePartCountInTagG
Gets or sets a value indicating whether the part count is included in the tag G.

Tekla.Structures.Drawing.StraightDimensionSet.StraightDimensionSetAttributes.LeftUpperTag
The left upper dimension tag.

Tekla.Structures.Drawing.StraightDimensionSet.StraightDimensionSetAttributes.LeftMiddleTag
The left middle dimension tag.

Tekla.Structures.Drawing.StraightDimensionSet.StraightDimensionSetAttributes.RightUpperTag
The right upper dimension tag.

Tekla.Structures.Drawing.StraightDimensionSet.StraightDimensionSetAttributes.RightMiddleTag
The right middle dimension tag.

Tekla.Structures.Drawing.StraightDimensionSet.StraightDimensionSetAttributes.LeftLowerTag
The left lower dimension tag.

Tekla.Structures.Drawing.StraightDimensionSet.StraightDimensionSetAttributes.RightLowerTag
The right lower dimension tag.

Tekla.Structures.Drawing.StraightDimensionSet.StraightDimensionSetAttributes.MiddleLowerTag
The middle lower dimension tag. Internal for API compatibility.

Tekla.Structures.Drawing.StraightDimensionSet.StraightDimensionSetAttributes.DimensionValuePostfix
The value postfix. Internal for API compatibility.

Tekla.Structures.Drawing.StraightDimensionSet.StraightDimensionSetAttributes.DimensionValuePrefix
The value prefix. Internal for API compatibility.

Tekla.Structures.Drawing.StraightDimensionSet.StraightDimensionSetAttributes.ExcludePartsAccordingToFilter
Sets the filter to use for excluding parts from the tags.
You may query the possible filters using StraightDimensionSet.GetAllExcludePartsAccordingToFilter()

Tekla.Structures.Drawing.StraightDimensionSet.StraightDimensionSetAttributes.Exaggeration
The exaggeration attributes of the dimension.

Tekla.Structures.Drawing.StraightDimensionSet.StraightDimensionSetAttributes.#ctor
Creates a default straight dimension set attributes instance that loads standard attributes.

Tekla.Structures.Drawing.StraightDimensionSet.StraightDimensionSetAttributes.#ctor(System.String)
Creates a straight dimension set attributes instance that loads the specified attributes.
AttributesFile: The filename of the attributes file.

Tekla.Structures.Drawing.StraightDimensionSet.StraightDimensionSetAttributes.#ctor(Tekla.Structures.Drawing.ModelObject)
Creates a default straight dimension set attributes instance that loads standard attributes.
modelObject: The model object that the dimension set will be associated with.

Tekla.Structures.Drawing.StraightDimensionSet.StraightDimensionSetAttributes.#ctor(Tekla.Structures.Drawing.ModelObject,System.Boolean)
Creates a default straight dimension set attributes instance that loads standard attributes.
modelObject: The model object that the dimension set will be associated with.
SkipLoadingAttributes: Defines if attribute loading should be skipped.

Tekla.Structures.Drawing.StraightDimensionSet.StraightDimensionSetAttributes.#ctor(Tekla.Structures.Drawing.ModelObject,System.String)
Creates a straight dimension set attributes instance that loads the specified attributes.
AttributesFile: The filename of the attributes file.
modelObject: The model object that the dimension set will be associated with.

Tekla.Structures.Drawing.StraightDimensionSet.StraightDimensionSetAttributes.#ctor(Tekla.Structures.Drawing.ModelObject,System.String,System.Boolean)
Creates a straight dimension set attributes instance that loads the specified attributes.
AttributesFile: The filename of the attributes file.
modelObject: The model object that the dimension set will be associated with.
SkipLoadingAttributes: Defines if attribute loading should be skipped.

Tekla.Structures.Drawing.StraightDimensionSet.StraightDimensionSetAttributes.LoadAttributes(System.String)
Loads the attributes from the attribute file.
attributeFilename: The filename of the attribute file.
Returns: True if the attributes are loaded correctly. False if the attribute file loading failed.

Tekla.Structures.Drawing.StraightDimensionSet.StraightDimensionSetAttributes.IsEqual(System.Object)
Compares the current object with an object of the same type.
ObjectToCompare: The object to be used for comparing.
Returns: True if all the fields (except for the database GUID) of the objects match.